package com.praire.fire.okhttp.JavaBean;

import java.util.List;

/**
 * Created by sunlo on 2018/2/3.
 */

public class BankCityBean {

    /**
     * code : 1
     * city : [{"id":"1","pid":"0","name":"北京"},{"id":"2","pid":"0","name":"天津"},{"id":"3","pid":"0","name":"河北","_child":[{"id":"4","pid":"3","name":"石家庄"},{"id":"5","pid":"3","name":"保定"},{"id":"6","pid":"3","name":"沧州"},{"id":"7","pid":"3","name":"承德"},{"id":"8","pid":"3","name":"邯郸"},{"id":"9","pid":"3","name":"衡水"},{"id":"10","pid":"3","name":"廊坊"},{"id":"11","pid":"3","name":"秦皇岛"},{"id":"12","pid":"3","name":"唐山"},{"id":"13","pid":"3","name":"邢台"},{"id":"14","pid":"3","name":"张家口"}]},{"id":"15","pid":"0","name":"山西","_child":[{"id":"16","pid":"15","name":"太原"},{"id":"17","pid":"15","name":"长治"},{"id":"18","pid":"15","name":"大同"},{"id":"19","pid":"15","name":"晋城"},{"id":"20","pid":"15","name":"离石"},{"id":"21","pid":"15","name":"临汾"},{"id":"22","pid":"15","name":"朔州"},{"id":"23","pid":"15","name":"忻州"},{"id":"24","pid":"15","name":"阳泉"},{"id":"25","pid":"15","name":"榆次"},{"id":"26","pid":"15","name":"运城"},{"id":"27","pid":"15","name":"晋中"},{"id":"28","pid":"15","name":"吕梁"}]},{"id":"29","pid":"0","name":"内蒙古","_child":[{"id":"30","pid":"29","name":"呼和浩特"},{"id":"31","pid":"29","name":"包头"},{"id":"32","pid":"29","name":"阿拉善"},{"id":"33","pid":"29","name":"巴彦淖尔"},{"id":"34","pid":"29","name":"赤峰"},{"id":"35","pid":"29","name":"呼伦贝尔"},{"id":"36","pid":"29","name":"乌海"},{"id":"37","pid":"29","name":"乌兰察布"},{"id":"38","pid":"29","name":"锡林郭勒"},{"id":"39","pid":"29","name":"兴安"},{"id":"40","pid":"29","name":"鄂尔多斯"},{"id":"41","pid":"29","name":"通辽"}]},{"id":"42","pid":"0","name":"辽宁","_child":[{"id":"43","pid":"42","name":"沈阳"},{"id":"44","pid":"42","name":"大连"},{"id":"45","pid":"42","name":"鞍山"},{"id":"46","pid":"42","name":"本溪"},{"id":"47","pid":"42","name":"朝阳"},{"id":"48","pid":"42","name":"丹东"},{"id":"49","pid":"42","name":"抚顺"},{"id":"50","pid":"42","name":"阜新"},{"id":"51","pid":"42","name":"葫芦岛"},{"id":"52","pid":"42","name":"锦州"},{"id":"53","pid":"42","name":"辽阳"},{"id":"54","pid":"42","name":"盘锦"},{"id":"55","pid":"42","name":"铁岭"},{"id":"56","pid":"42","name":"营口"}]},{"id":"57","pid":"0","name":"吉林","_child":[{"id":"58","pid":"57","name":"长春"},{"id":"59","pid":"57","name":"白城"},{"id":"60","pid":"57","name":"白山"},{"id":"61","pid":"57","name":"吉林"},{"id":"62","pid":"57","name":"辽源"},{"id":"63","pid":"57","name":"四平"},{"id":"64","pid":"57","name":"松原"},{"id":"65","pid":"57","name":"通化"},{"id":"66","pid":"57","name":"延边"}]},{"id":"67","pid":"0","name":"湖北","_child":[{"id":"68","pid":"67","name":"孝感"},{"id":"69","pid":"67","name":"神农架"},{"id":"70","pid":"67","name":"天门"},{"id":"71","pid":"67","name":"宜昌"},{"id":"72","pid":"67","name":"三峡"},{"id":"207","pid":"67","name":"武汉"},{"id":"208","pid":"67","name":"鄂州"},{"id":"209","pid":"67","name":"恩施"},{"id":"210","pid":"67","name":"黄冈"},{"id":"211","pid":"67","name":"黄石"},{"id":"212","pid":"67","name":"荆门"},{"id":"213","pid":"67","name":"荆州"},{"id":"214","pid":"67","name":"十堰"},{"id":"215","pid":"67","name":"随州"},{"id":"216","pid":"67","name":"咸宁"},{"id":"217","pid":"67","name":"襄樊"}]},{"id":"73","pid":"0","name":"湖南","_child":[{"id":"74","pid":"73","name":"长沙"},{"id":"75","pid":"73","name":"常德"},{"id":"76","pid":"73","name":"郴州"},{"id":"77","pid":"73","name":"衡阳"},{"id":"229","pid":"73","name":"怀化"},{"id":"230","pid":"73","name":"娄底"},{"id":"231","pid":"73","name":"邵阳"},{"id":"232","pid":"73","name":"湘潭"},{"id":"233","pid":"73","name":"湘西"},{"id":"234","pid":"73","name":"益阳"},{"id":"235","pid":"73","name":"永州"},{"id":"236","pid":"73","name":"岳阳"},{"id":"237","pid":"73","name":"张家界"},{"id":"238","pid":"73","name":"株洲"}]},{"id":"78","pid":"0","name":"黑龙江","_child":[{"id":"79","pid":"78","name":"哈尔滨"},{"id":"80","pid":"78","name":"大庆"},{"id":"81","pid":"78","name":"大兴安岭"},{"id":"82","pid":"78","name":"鹤岗"},{"id":"83","pid":"78","name":"黑河"},{"id":"84","pid":"78","name":"鸡西"},{"id":"85","pid":"78","name":"佳木斯"},{"id":"86","pid":"78","name":"牡丹江"},{"id":"87","pid":"78","name":"七台河"},{"id":"88","pid":"78","name":"齐齐哈尔"},{"id":"89","pid":"78","name":"双鸭山"},{"id":"90","pid":"78","name":"绥化"},{"id":"91","pid":"78","name":"伊春"}]},{"id":"92","pid":"0","name":"上海"},{"id":"93","pid":"0","name":"江苏","_child":[{"id":"94","pid":"93","name":"南京"},{"id":"95","pid":"93","name":"常州"},{"id":"96","pid":"93","name":"淮安"},{"id":"97","pid":"93","name":"连云港"},{"id":"98","pid":"93","name":"南通"},{"id":"99","pid":"93","name":"苏州"},{"id":"100","pid":"93","name":"宿迁"},{"id":"101","pid":"93","name":"泰州"},{"id":"102","pid":"93","name":"无锡"},{"id":"103","pid":"93","name":"徐州"},{"id":"104","pid":"93","name":"盐城"},{"id":"105","pid":"93","name":"扬州"},{"id":"106","pid":"93","name":"镇江"},{"id":"107","pid":"93","name":"胥浦"}]},{"id":"108","pid":"0","name":"浙江","_child":[{"id":"109","pid":"108","name":"杭州"},{"id":"110","pid":"108","name":"宁波"},{"id":"111","pid":"108","name":"湖州"},{"id":"112","pid":"108","name":"嘉兴"},{"id":"113","pid":"108","name":"金华"},{"id":"114","pid":"108","name":"绍兴"},{"id":"115","pid":"108","name":"台州"},{"id":"116","pid":"108","name":"温州"},{"id":"117","pid":"108","name":"舟山"},{"id":"118","pid":"108","name":"衢州"},{"id":"119","pid":"108","name":"丽水"}]},{"id":"120","pid":"0","name":"安徽","_child":[{"id":"121","pid":"120","name":"合肥"},{"id":"122","pid":"120","name":"安庆"},{"id":"123","pid":"120","name":"蚌埠"},{"id":"124","pid":"120","name":"巢湖"},{"id":"125","pid":"120","name":"池州"},{"id":"126","pid":"120","name":"滁州"},{"id":"127","pid":"120","name":"阜阳"},{"id":"128","pid":"120","name":"淮北"},{"id":"129","pid":"120","name":"淮南"},{"id":"130","pid":"120","name":"黄山"},{"id":"131","pid":"120","name":"六安"},{"id":"132","pid":"120","name":"马鞍山"},{"id":"133","pid":"120","name":"铜陵"},{"id":"134","pid":"120","name":"芜湖"},{"id":"135","pid":"120","name":"宣城"},{"id":"136","pid":"120","name":"亳州"},{"id":"137","pid":"120","name":"宿迁"}]},{"id":"138","pid":"0","name":"福建","_child":[{"id":"139","pid":"138","name":"福州"},{"id":"140","pid":"138","name":"厦门"},{"id":"141","pid":"138","name":"龙岩"},{"id":"142","pid":"138","name":"南平"},{"id":"143","pid":"138","name":"宁德"},{"id":"154","pid":"138","name":"莆田"},{"id":"155","pid":"138","name":"泉州"},{"id":"156","pid":"138","name":"三明"},{"id":"157","pid":"138","name":"漳州"}]},{"id":"144","pid":"0","name":"海南","_child":[{"id":"145","pid":"144","name":"定安"},{"id":"146","pid":"144","name":"东方"},{"id":"147","pid":"144","name":"乐东"},{"id":"148","pid":"144","name":"临高"},{"id":"149","pid":"144","name":"陵水"},{"id":"150","pid":"144","name":"琼海"},{"id":"151","pid":"144","name":"琼中"},{"id":"152","pid":"144","name":"屯昌"},{"id":"153","pid":"144","name":"万宁"},{"id":"273","pid":"144","name":"文昌"},{"id":"274","pid":"144","name":"五指山"},{"id":"275","pid":"144","name":"洋浦"},{"id":"367","pid":"144","name":"海口"},{"id":"368","pid":"144","name":"三亚"},{"id":"369","pid":"144","name":"白沙"},{"id":"370","pid":"144","name":"保亭"},{"id":"371","pid":"144","name":"昌江"},{"id":"372","pid":"144","name":"澄迈"},{"id":"373","pid":"144","name":"儋州"}]},{"id":"158","pid":"0","name":"江西","_child":[{"id":"159","pid":"158","name":"南昌"},{"id":"160","pid":"158","name":"抚州"},{"id":"161","pid":"158","name":"赣州"},{"id":"162","pid":"158","name":"吉安"},{"id":"163","pid":"158","name":"景德镇"},{"id":"164","pid":"158","name":"九江"},{"id":"165","pid":"158","name":"萍乡"},{"id":"166","pid":"158","name":"上饶"},{"id":"167","pid":"158","name":"新余"},{"id":"168","pid":"158","name":"宜春"},{"id":"169","pid":"158","name":"鹰潭"}]},{"id":"170","pid":"0","name":"山东","_child":[{"id":"171","pid":"170","name":"济南"},{"id":"172","pid":"170","name":"青岛"},{"id":"173","pid":"170","name":"滨州"},{"id":"174","pid":"170","name":"德州"},{"id":"175","pid":"170","name":"东营"},{"id":"176","pid":"170","name":"菏泽"},{"id":"177","pid":"170","name":"济宁"},{"id":"178","pid":"170","name":"莱芜"},{"id":"179","pid":"170","name":"聊城"},{"id":"180","pid":"170","name":"临沂"},{"id":"181","pid":"170","name":"日照"},{"id":"182","pid":"170","name":"泰安"},{"id":"183","pid":"170","name":"威海"},{"id":"184","pid":"170","name":"潍坊"},{"id":"185","pid":"170","name":"烟台"},{"id":"186","pid":"170","name":"枣庄"},{"id":"187","pid":"170","name":"淄博"}]},{"id":"188","pid":"0","name":"河南","_child":[{"id":"189","pid":"188","name":"郑州"},{"id":"190","pid":"188","name":"安阳"},{"id":"191","pid":"188","name":"焦作"},{"id":"192","pid":"188","name":"鹤壁"},{"id":"193","pid":"188","name":"开封"},{"id":"194","pid":"188","name":"洛阳"},{"id":"195","pid":"188","name":"南阳"},{"id":"196","pid":"188","name":"平顶山"},{"id":"197","pid":"188","name":"三门峡"},{"id":"198","pid":"188","name":"商丘"},{"id":"199","pid":"188","name":"新乡"},{"id":"200","pid":"188","name":"信阳"},{"id":"201","pid":"188","name":"许昌"},{"id":"202","pid":"188","name":"周口"},{"id":"203","pid":"188","name":"驻马店"},{"id":"204","pid":"188","name":"漯河"},{"id":"205","pid":"188","name":"濮阳"},{"id":"206","pid":"188","name":"济源"}]},{"id":"218","pid":"0","name":"西藏","_child":[{"id":"219","pid":"218","name":"阿里"},{"id":"220","pid":"218","name":"昌都"},{"id":"221","pid":"218","name":"林芝"},{"id":"222","pid":"218","name":"那曲"},{"id":"223","pid":"218","name":"日喀则"},{"id":"224","pid":"218","name":"山南"},{"id":"383","pid":"218","name":"拉萨"}]},{"id":"225","pid":"0","name":"陕西","_child":[{"id":"226","pid":"225","name":"西安"},{"id":"227","pid":"225","name":"安康"},{"id":"228","pid":"225","name":"宝鸡"},{"id":"318","pid":"225","name":"汉中"},{"id":"319","pid":"225","name":"商洛"},{"id":"320","pid":"225","name":"铜川"},{"id":"321","pid":"225","name":"渭南"},{"id":"322","pid":"225","name":"咸阳"},{"id":"323","pid":"225","name":"延安"},{"id":"324","pid":"225","name":"榆林"}]},{"id":"239","pid":"0","name":"广东","_child":[{"id":"240","pid":"239","name":"广州"},{"id":"241","pid":"239","name":"深圳"},{"id":"242","pid":"239","name":"潮州"},{"id":"243","pid":"239","name":"东莞"},{"id":"244","pid":"239","name":"佛山"},{"id":"245","pid":"239","name":"惠州"},{"id":"246","pid":"239","name":"江门"},{"id":"247","pid":"239","name":"揭阳"},{"id":"248","pid":"239","name":"茂名"},{"id":"249","pid":"239","name":"梅州"},{"id":"250","pid":"239","name":"清远"},{"id":"251","pid":"239","name":"汕头"},{"id":"252","pid":"239","name":"汕尾"},{"id":"253","pid":"239","name":"韶关"},{"id":"254","pid":"239","name":"阳江"},{"id":"255","pid":"239","name":"云浮"},{"id":"256","pid":"239","name":"湛江"},{"id":"257","pid":"239","name":"肇庆"},{"id":"258","pid":"239","name":"中山"},{"id":"259","pid":"239","name":"河源"},{"id":"260","pid":"239","name":"珠海"}]},{"id":"261","pid":"0","name":"广西","_child":[{"id":"262","pid":"261","name":"南宁"},{"id":"263","pid":"261","name":"百色"},{"id":"264","pid":"261","name":"北海"},{"id":"265","pid":"261","name":"桂林"},{"id":"266","pid":"261","name":"河池"},{"id":"267","pid":"261","name":"柳州"},{"id":"268","pid":"261","name":"梧州"},{"id":"269","pid":"261","name":"玉林"},{"id":"270","pid":"261","name":"崇左"},{"id":"271","pid":"261","name":"防城港"},{"id":"272","pid":"261","name":"贵港"},{"id":"364","pid":"261","name":"贺州"},{"id":"365","pid":"261","name":"来宾"},{"id":"366","pid":"261","name":"钦州"}]},{"id":"276","pid":"0","name":"重庆"},{"id":"277","pid":"0","name":"四川","_child":[{"id":"278","pid":"277","name":"成都"},{"id":"279","pid":"277","name":"巴中"},{"id":"280","pid":"277","name":"达州"},{"id":"281","pid":"277","name":"德州"},{"id":"282","pid":"277","name":"广安"},{"id":"283","pid":"277","name":"广元"},{"id":"284","pid":"277","name":"乐山"},{"id":"285","pid":"277","name":"凉山"},{"id":"286","pid":"277","name":"眉山"},{"id":"287","pid":"277","name":"绵阳"},{"id":"288","pid":"277","name":"南充"},{"id":"289","pid":"277","name":"内江"},{"id":"290","pid":"277","name":"攀枝花"},{"id":"291","pid":"277","name":"遂宁"},{"id":"292","pid":"277","name":"雅安"},{"id":"293","pid":"277","name":"宜宾"},{"id":"294","pid":"277","name":"自贡"},{"id":"295","pid":"277","name":"泸州"},{"id":"296","pid":"277","name":"阿坝"},{"id":"297","pid":"277","name":"甘孜"},{"id":"298","pid":"277","name":"资阳"}]},{"id":"299","pid":"0","name":"贵州","_child":[{"id":"300","pid":"299","name":"贵阳"},{"id":"301","pid":"299","name":"安顺"},{"id":"302","pid":"299","name":"毕节"},{"id":"303","pid":"299","name":"六盘水"},{"id":"304","pid":"299","name":"铜仁"},{"id":"305","pid":"299","name":"遵义"},{"id":"306","pid":"299","name":"黔东南"},{"id":"307","pid":"299","name":"黔南"},{"id":"308","pid":"299","name":"黔西南"}]},{"id":"309","pid":"0","name":"云南","_child":[{"id":"310","pid":"309","name":"昆明"},{"id":"311","pid":"309","name":"西双版纳"},{"id":"312","pid":"309","name":"保山"},{"id":"313","pid":"309","name":"楚雄"},{"id":"314","pid":"309","name":"大理"},{"id":"315","pid":"309","name":"德宏"},{"id":"316","pid":"309","name":"红河"},{"id":"317","pid":"309","name":"丽江"},{"id":"374","pid":"309","name":"临沧"},{"id":"375","pid":"309","name":"怒江"},{"id":"376","pid":"309","name":"曲靖"},{"id":"377","pid":"309","name":"思茅"},{"id":"378","pid":"309","name":"文山"},{"id":"379","pid":"309","name":"玉溪"},{"id":"380","pid":"309","name":"昭通"},{"id":"381","pid":"309","name":"中甸"},{"id":"382","pid":"309","name":"迪庆州"}]},{"id":"325","pid":"0","name":"甘肃","_child":[{"id":"326","pid":"325","name":"兰州"},{"id":"327","pid":"325","name":"白银"},{"id":"328","pid":"325","name":"定西"},{"id":"329","pid":"325","name":"东风"},{"id":"330","pid":"325","name":"合作"},{"id":"331","pid":"325","name":"嘉峪关"},{"id":"332","pid":"325","name":"金昌"},{"id":"333","pid":"325","name":"酒泉"},{"id":"334","pid":"325","name":"矿区"},{"id":"335","pid":"325","name":"临夏"},{"id":"336","pid":"325","name":"陇南"},{"id":"337","pid":"325","name":"平凉"},{"id":"338","pid":"325","name":"庆阳"},{"id":"339","pid":"325","name":"天水"},{"id":"340","pid":"325","name":"武威"},{"id":"341","pid":"325","name":"张掖"},{"id":"342","pid":"325","name":"甘南州"}]},{"id":"343","pid":"0","name":"青海","_child":[{"id":"344","pid":"343","name":"西宁"},{"id":"345","pid":"343","name":"海东"}]},{"id":"346","pid":"0","name":"宁夏","_child":[{"id":"347","pid":"346","name":"银川"},{"id":"348","pid":"346","name":"中卫"},{"id":"349","pid":"346","name":"固原"},{"id":"350","pid":"346","name":"石嘴山"},{"id":"351","pid":"346","name":"吴忠"}]},{"id":"352","pid":"0","name":"新疆","_child":[{"id":"353","pid":"352","name":"乌鲁木齐"},{"id":"354","pid":"352","name":"阿克苏"},{"id":"355","pid":"352","name":"阿勒泰"},{"id":"356","pid":"352","name":"巴州"},{"id":"357","pid":"352","name":"博州"},{"id":"358","pid":"352","name":"昌吉"},{"id":"359","pid":"352","name":"哈密"},{"id":"360","pid":"352","name":"和田"},{"id":"361","pid":"352","name":"喀什"},{"id":"362","pid":"352","name":"克拉玛依"},{"id":"363","pid":"352","name":"马兰"},{"id":"384","pid":"352","name":"石河子"},{"id":"385","pid":"352","name":"塔城"},{"id":"386","pid":"352","name":"吐鲁番"},{"id":"387","pid":"352","name":"伊犁"},{"id":"388","pid":"352","name":"克州"},{"id":"389","pid":"352","name":"阿拉尔"},{"id":"390","pid":"352","name":"五家渠"}]},{"id":"391","pid":"0","name":"香港"},{"id":"392","pid":"0","name":"澳门"},{"id":"393","pid":"0","name":"台湾"}]
     */

    private int code;
    private List<CityBean> city;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public List<CityBean> getCity() {
        return city;
    }

    public void setCity(List<CityBean> city) {
        this.city = city;
    }

    public static class CityBean {
        /**
         * id : 1
         * pid : 0
         * name : 北京
         * _child : [{"id":"4","pid":"3","name":"石家庄"},{"id":"5","pid":"3","name":"保定"},{"id":"6","pid":"3","name":"沧州"},{"id":"7","pid":"3","name":"承德"},{"id":"8","pid":"3","name":"邯郸"},{"id":"9","pid":"3","name":"衡水"},{"id":"10","pid":"3","name":"廊坊"},{"id":"11","pid":"3","name":"秦皇岛"},{"id":"12","pid":"3","name":"唐山"},{"id":"13","pid":"3","name":"邢台"},{"id":"14","pid":"3","name":"张家口"}]
         */

        private String id;
        private String pid;
        private String name;
        private List<ChildBean> _child;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getPid() {
            return pid;
        }

        public void setPid(String pid) {
            this.pid = pid;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public List<ChildBean> get_child() {
            return _child;
        }

        public void set_child(List<ChildBean> _child) {
            this._child = _child;
        }

        public static class ChildBean {
            /**
             * id : 4
             * pid : 3
             * name : 石家庄
             */

            private String id;
            private String pid;
            private String name;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getPid() {
                return pid;
            }

            public void setPid(String pid) {
                this.pid = pid;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }
        }
    }
}
